In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [3]:
df = pd.read_csv("crop_production.csv")
df.head()

  Zone_Name  Crop_Year                 Crop    Area  Production
0   Abeshge       2000             Arecanut  1254.0      2000.0
1   Abeshge       2000  Other Kharif pulses     2.0         1.0
2   Abeshge       2000                 Rice   102.0       321.0
3   Abeshge       2000               Banana   176.0       641.0
4   Abeshge       2000            Cashewnut   720.0       165.0

In [4]:
# Droping Nan Values
data = df.dropna()
print(data.shape)
test = df[~df["Production"].notna()].drop("Production",axis=1)
print(test.shape)

(242361, 5)
(3730, 4)

In [5]:
data.to_csv('crop_data.csv')

In [37]:

a = ['Wheat', 'Onion', 'Orange', 'Rice', 'Tomato','Coffee']

In [38]:
for i in a:
    print("(data['Crop'] == '%s') |" % i, end=' ')

(data['Crop'] == 'Wheat') | (data['Crop'] == 'Onion') | (data['Crop'] == 'Orange') | (data['Crop'] == 'Rice') | (data['Crop'] == 'Tomato') | (data['Crop'] == 'Coffee') |

In [39]:
x= data[data['Crop'].isin(a)]

In [40]:
x.head()

   Zone_Name  Crop_Year  Crop    Area  Production
2    Abeshge       2000  Rice  102.00      321.00
12   Abeshge       2001  Rice   83.00      300.00
18   Abeshge       2002  Rice  189.20      510.84
27   Abeshge       2003  Rice   52.00       90.17
36   Abeshge       2004  Rice   52.94       72.57

In [41]:
x.shape

(30589, 5)

In [42]:
x.to_csv('crop_last_data.csv')

<bound method NDFrame.to_csv of        Zone_Name  Crop_Year   Crop       Area  Production
2        Abeshge       2000   Rice     102.00      321.00
12       Abeshge       2001   Rice      83.00      300.00
18       Abeshge       2002   Rice     189.20      510.84
27       Abeshge       2003   Rice      52.00       90.17
36       Abeshge       2004   Rice      52.94       72.57
...          ...        ...    ...        ...         ...
246052     Silte       2013   Rice  302274.00   730136.00
246058     Silte       2014   Rice     264.00      721.00
246084     Silte       2014  Wheat    1622.00     3663.00
246086     Silte       2014   Rice     306.00      801.00
246089     Silte       2014   Rice  279151.00   597899.00

[30589 rows x 5 columns]>